Examinator/src/Catalogs/РесурсыСУЗ/РесурсыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РесурсыСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Общие</name>
      <description>Общие</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Служебные</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентичныйРесурс</name>
    <comment>Важно! Данный реквизит должен стоять перед реквизитом ФайлЗапуска, так как при экспорте необходимо сначала зарегистрировать идентичный ресурс, а потом файл, иначе ресурс будет экспортирован не полностью.</comment>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЗапуска</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯкорьЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SCO</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинственныйФайл</name>
    <type>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ИмпортированныеЭлементыПакетаSCORM/ИмпортированныеЭлементыПакетаSCORM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИмпортированныеЭлементыПакетаSCORM</name>
  <resources>
    <name>ИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаЭлемент</name>
    <type>
      <types>ExchangePlanRef.ОбменМатериаламиСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/СодержаниеСУЗ/СодержаниеСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СодержаниеСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СводыЗнанийСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЭлемент</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <comment>Item / parameters</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>limitConditions / attemptLimit</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПопытки</name>
    <comment>limitConditions / attemptAbsoluteDurationLimit (Тип: duration SCORM)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогВыполнения</name>
    <comment>completionThreshold</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИнициализации</name>
    <comment>dataFromLMS</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПослеИстеченияВремени</name>
    <comment>timeLimitAction</comment>
    <type>
      <types>EnumRef.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьСсылкиНаТерминыГлоссария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменятьПользовательскиеНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактироватьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/РесурсыСУЗ/Forms/ФормаЭлементаSCORM/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Интерактивное создание элемента SCORM не поддерживается'"),,,,Отказ);
		Возврат;
	КонецЕсли;
	
	ЭлектронныйРесурс = Параметры.ЭлектронныйРесурс;
	ЭлементСодержания = Параметры.ЭлементСодержания;
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс)
		ИЛИ НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Форма может быть открыта только из курса'"),,,,Отказ);
			
		Возврат;
		
	КонецЕсли;
	
	НаименованиеЭлементаСодержания = Общегоназначения.ЗначениеРеквизитаОбъекта(ЭлементСодержания, "Наименование");
	ДатаЗагрузки = ДатаЗагрузкиПакета();
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'SCORM элемент - %1'"),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСодержания, "Наименование"));	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазработкаСУЗКлиент.УстановитьКонтекстЭлектронногоРесурса(ЭтотОбъект);	
	
	ПодключитьОбработчикОжидания("НачатьЗаполнениеТаблицыНастроек", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(НаименованиеЭлементаСодержания) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите наименование элемента'"),, "НаименованиеЭлементаСодержания",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьНастройки();
	
	Справочники.СодержаниеСУЗ.Перезаписать(ЭлементСодержания, НаименованиеЭлементаСодержания);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбъектСУЗЗаписан", Объект.Ссылка, ЭтотОбъект);
	Оповестить("РесурсЗаписан", Объект.Ссылка, ЭтотОбъект); // Всегда	
	Оповестить("ЭлектронныйРесурсОбновлен", ЭлектронныйРесурс, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЗадатьИспользованиеВручнуюПриИзменении(Элемент)
	Если ЗадатьИспользованиеВручную Тогда
		УстановитьДоступностьЭлементовФормы();
	Иначе
		СброситьНастройкиТаблицы();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПерейтиКФайлам(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ОткрытьФормуРесурса", Истина);
	ОбщегоНазначенияСУКлиент.ОткрытьЗначениеВФорме(Объект.Ссылка, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьДоступностьТаблицыНастроек()
	
	Если ТаблицаНастроекЗагружена Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки;
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗагрузка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаполнениеТаблицыНастроек()
		
	ТаблицаНастроекЗагружена = Ложь;
	УстановитьДоступностьТаблицыНастроек();
	
	ДлительнаяОперация = НачатьЗаполнениеТаблицыНастроекНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьЗаполнениеТаблицыНастроек", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаполнениеТаблицыНастроекНаСервере()
	
	ИмяПроцедуры = "Справочники.РесурсыСУЗ.СформироватьТаблицуИспользованияПараметровSCORMВФоне";
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ЭлектронныйРесурс", ЭлектронныйРесурс);
	ПараметрыПроцедуры.Вставить("ЭлементСодержания", ЭлементСодержания);
	ПараметрыПроцедуры.Вставить("ДатаЗагрузки", ДатаЗагрузки);
	
	ПараметрыВыполнения	= ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыПроцедуры, ПараметрыВыполнения);	
	
КонецФункции

&НаСервере
Функция ДатаЗагрузкиПакета()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИмпортированныеЭлементыПакетаSCORM.ДатаИзменения КАК ДатаИзменения
		|ИЗ
		|	РегистрСведений.ИмпортированныеЭлементыПакетаSCORM КАК ИмпортированныеЭлементыПакетаSCORM
		|ГДЕ
		|	ИмпортированныеЭлементыПакетаSCORM.СсылкаНаЭлемент = &ЭлементСодержания";
	
	Запрос.УстановитьПараметр("ЭлементСодержания", ЭлементСодержания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно получить дату загрузки пакета'");
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.ДатаИзменения;
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьЗаполнениеТаблицыНастроек(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗавершитьЗаполнениеТаблицыНастроекНаСервере(Результат);
	УстановитьДоступностьТаблицыНастроек();
КонецПроцедуры 

&НаСервере
Процедура ЗавершитьЗаполнениеТаблицыНастроекНаСервере(Результат)
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполняется" Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.ПодробноеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Отменено" Тогда
		ВызватьИсключение НСтр("ru = 'Действие отменено'");
	КонецЕсли;
	
	ТаблицаСтатистики = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если ТипЗнч(ТаблицаСтатистики) <> Тип("ТаблицаЗначений") Тогда
		ВызватьИсключение НСтр("ru = 'Таблица не сформирована'");
	КонецЕсли;
	
	ТаблицаНастроек.Очистить();
	
	НастройкиПакетаSCORM = Справочники.РесурсыСУЗ.НастройкиПакетаSCORM(Объект.Ссылка);
	ЗадатьИспользованиеВручную = НЕ НастройкиПакетаSCORM.ЭтоНастройкиПоУмолчанию;
	СохраненныеНастройки = НастройкиПакетаSCORM.ТаблицаНастроек;	
	
	Для каждого Параметр Из Перечисления.ИспользуемыеПараметрыSCORM Цикл
				
		СтруктураПоискаЕстьСтатистика = Новый Структура("Параметр", Параметр);
		СтруктураПоискаПередается = Новый Структура("Параметр, Передан", Параметр, Истина);
		СтруктураПоискаПередаетсяСОшибками = Новый Структура("Параметр, ПереданСОшибкой", Параметр, Истина);
		
		ЕстьСтатистика = ТаблицаСтатистики.НайтиСтроки(СтруктураПоискаЕстьСтатистика).Количество() > 0;
		Передается = ТаблицаСтатистики.НайтиСтроки(СтруктураПоискаПередается).Количество() > 0;
		ПередаетсяСОшибками = ТаблицаСтатистики.НайтиСтроки(СтруктураПоискаПередаетсяСОшибками).Количество() > 0;
		
		НоваяСтрока = ТаблицаНастроек.Добавить();	
		НоваяСтрока.Параметр = Параметр;
		НоваяСтрока.Передается = Передается;
		НоваяСтрока.ПередаетсяСОшибками = ПередаетсяСОшибками;
		НоваяСтрока.ЕстьСтатистика = ЕстьСтатистика;
		
		Если ЕстьСтатистика Тогда
			
			Если НЕ Передается Тогда
				НоваяСтрока.Статистика = НСтр("ru = 'Не передается'");
			КонецЕсли;
			
			Если Передается И НЕ ПередаетсяСОшибками Тогда
				НоваяСтрока.Статистика = НСтр("ru = 'Передается без ошибок'");
			КонецЕсли;
			
			Если ПередаетсяСОшибками Тогда
				НоваяСтрока.Статистика = НСтр("ru = 'Передается с ошибками'");
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока.Статистика = НСтр("ru = 'Нет данных'");
			
		КонецЕсли;
		
		СтрокаТСН = СохраненныеНастройки.Найти(Параметр, "Параметр");
		
		Если НастройкиПакетаSCORM.ЭтоНастройкиПоУмолчанию Тогда
			НоваяСтрока.Используется = ЗначениеНастройкиИспользуетсяПоУмолчанию(
				СтрокаТСН.Используется, Параметр, ЕстьСтатистика, Передается, ПередаетсяСОшибками);
		Иначе
			НоваяСтрока.Используется = СтрокаТСН.Используется;
		КонецЕсли;
		
		Если СохраненныеНастройки.Колонки.Найти("Комментарий") <> Неопределено Тогда
			НоваяСтрока.Комментарий = СтрокаТСН.Комментарий;
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьРеквизитТолькоПросмотр();
	
	ТаблицаНастроекЗагружена = Истина;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Функция ЗначениеНастройкиИспользуетсяПоУмолчанию(ТекущееЗначение, Параметр, ЕстьСтатистика, Передается, ПередаетсяСОшибками)
	
	Если ЕстьСтатистика И НЕ Передается Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат ТекущееЗначение;
	
КонецФункции

&НаСервере
Процедура УстановитьРеквизитТолькоПросмотр()
	Для каждого Строка Из ТаблицаНастроек Цикл			
		Если ЗадатьИспользованиеВручную Тогда
			Если Строка.Используется Тогда
				Строка.ТолькоПросмотр = Ложь;
			Иначе
				Строка.ТолькоПросмотр = НЕ Строка.Передается ИЛИ Строка.ПередаетсяСОшибками;
			КонецЕсли;
		Иначе
			Строка.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СброситьНастройкиТаблицы()
	
	НастройкиПоУмолчанию = Справочники.РесурсыСУЗ.НастройкиSCORMПоУмолчанию();
	
	Для каждого Параметр Из Перечисления.ИспользуемыеПараметрыSCORM Цикл
		СтрокаПоУмолчанию = НастройкиПоУмолчанию.Найти(Параметр, "Параметр");
		СтрокаНастроек = ТаблицаНастроек.НайтиСтроки(Новый Структура("Параметр", Параметр))[0];
		СтрокаНастроек.Используется = ЗначениеНастройкиИспользуетсяПоУмолчанию(
				СтрокаПоУмолчанию.Используется, Параметр, СтрокаНастроек.ЕстьСтатистика,
				СтрокаНастроек.Передается, СтрокаНастроек.ПередаетсяСОшибками);
		СтрокаНастроек.Комментарий = "";
	КонецЦикла;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	УстановитьРеквизитТолькоПросмотр();
	
	Элементы.ТаблицаНастроекКомментарий.ТолькоПросмотр = НЕ ЗадатьИспользованиеВручную;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройки()
	
	Если ЗадатьИспользованиеВручную Тогда
		
		ТаблицаДляЗаписи = Справочники.РесурсыСУЗ.НастройкиSCORMПоУмолчанию();
	
		Для каждого СтрокаТЗ Из ТаблицаДляЗаписи Цикл		
			СтрокаТЗ.Используется = ТаблицаНастроек.НайтиСтроки(Новый Структура("Параметр", СтрокаТЗ.Параметр))[0].Используется;		
			СтрокаТЗ.Комментарий = ТаблицаНастроек.НайтиСтроки(Новый Структура("Параметр", СтрокаТЗ.Параметр))[0].Комментарий;
		КонецЦикла;
		
		Справочники.РесурсыСУЗ.ЗаписатьНастройкиSCORM(Объект.Ссылка, ТаблицаДляЗаписи); 
		
	Иначе
		
		Справочники.РесурсыСУЗ.УдалитьНастройкиSCORM(Объект.Ссылка);
		
	КонецЕсли;
		
КонецПроцедуры



#КонецОбласти
